
% دریافت ضرایب چندجمله‌ای از کاربر
coefficients = input('لطفا ضرایب چندجمله‌ای را وارد کنید (به صورت بردار): ');

% دریافت دامنه ترسیم از کاربر
c = input('لطفا دامنه ترسیم را وارد کنید ');
d = input('لطفا عدد دوم دامنه ترسیم را وارد کنید ');

range = [c , d];
% تولید نقاط x برای ترسیم نمودار
x = linspace(range(1), range(2), 1000);

% محاسبه مقادیر y با استفاده از ضرایب چندجمله‌ای
y = polyval(coefficients, x);

% ترسیم نمودار
plot(x, y);
grid on;
title('نمودار چندجمله‌ای');
xlabel('x');
ylabel('y');
