% تمرین 6-1 جلسه چهارم

a = [16 15 17;12 11 20;17 18 20;18 19 11;10 9 5;2 4 20];

% بررسی می‌کند که آیا ورودی یک ماتریس است
 if size(a,1) ~= 1 && size(a,2) ~= 1
   b = a(:); % تبدیل ماتریس به بردار
   c = a(:);
else
   b = a;
end

% تعداد نمرات 
d = length(b);


% حلقه برای بررسی شروط
for i = 1:d
    if b(i) < 5
       b(i) = 9;
    elseif b(i) >= 5 && b(i) < 8
        b(i) = 9.5;
    elseif b(i) >= 8 && b(i) < 10
        b(i) = 10;
    elseif b(i) >= 10 && b(i) < 15
       b(i) = b(i) + 1;
    elseif b(i) >= 15 && b(i) < 20
        b(i) = b(i) + 0.5;
    % این دستور else برای نمرات بیشتر یا مساوی 20 اضافه شده است
    else
        b(i) = b(i); % نمرات بیشتر از 20 تغییر نمی‌کنند
    end
end
rot90(c);
rot90(b);
e = [c,b];
% نمایش نمرات تنظیم شده
disp('نمرات قبل و بعد دانشجویان:');
disp(e);

